{
  "backend/main.mo": "Motoko actor defining Service, Product, and ServiceRequest types with CRUD operations including add, delete, get, and list functions for managing computer repair services, products, and customer service requests.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: service listing page, product catalog page, service request form, tech-focused visual theme, and generated brand assets with high confidence test coverage.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React application structure with TanStack Router, pages for services/products/requests, reusable card components, React Query hooks, and tech-themed styling.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode design tokens for a professional tech aesthetic using slate grays, electric greens, and crisp whites.",
  "frontend/index.html": "HTML entry point for the Computer Repair & Sales Service application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with routes for home, services, products, and request-service pages, all wrapped in a Layout component.",
  "frontend/src/components/Layout.tsx": "Layout component with sticky header featuring logo, desktop/mobile navigation, footer with social links, and responsive menu toggle functionality.",
  "frontend/src/components/ProductCard.tsx": "Reusable card component displaying product information with placeholder icon, name, specifications, and formatted price with hover effects.",
  "frontend/src/components/ServiceCard.tsx": "Reusable card component displaying service information with name, description, and formatted price badge with hover effects.",
  "frontend/src/components/ServiceRequestForm.tsx": "React form component for submitting service requests with fields for customer name, device details, and issue description. Displays success/error alerts and uses the useSubmitServiceRequest mutation hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state and identity persistence. Wraps @dfinity/auth-client with React state management and lifecycle hooks.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for fetching services, products, and service requests from the backend actor. Includes a mutation hook for submitting new service requests with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a tech-focused color palette featuring slate grays and electric green accents. Includes both light and dark mode theme definitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page component with hero section, feature cards highlighting service benefits, and call-to-action buttons for requesting repairs and browsing products.",
  "frontend/src/pages/ProductsPage.tsx": "Product listing page that fetches and displays all products in a grid layout with loading and error states.",
  "frontend/src/pages/RequestServicePage.tsx": "Service request page featuring the ServiceRequestForm component alongside informational cards about response time, expert service, and warranty protection.",
  "frontend/src/pages/ServicesPage.tsx": "React page component that fetches and displays a grid of computer repair services using ServiceCard components, with loading and error states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (including tech-green), typography, container settings, animations, and design tokens using OKLCH color space.",
  "project_state.json": "Project metadata tracking completed features (service listing, product catalog, request form, tech-themed design) and pending backend data model implementation."
}