{
  "backend/main.mo": "Motoko actor implementing a computer repair and sales service backend with CRUD operations for services, products, and service requests using Map-based storage.",
  "feature_evidence.json": "Feature evidence report documenting the requirement to update the application name to 'TestAut' in the Layout component header navigation.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining design tokens for light and dark modes with tech-focused slate and green color palette.",
  "frontend/index.html": "HTML entry point for the React application with title 'Computer Repair & Sales Service' and root div mount point.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, services, products, and request service pages wrapped in Layout.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header displaying 'TestAut' branding, responsive navigation menu, and footer with social links.",
  "frontend/src/components/ProductCard.tsx": "Reusable card component displaying product information including name, specifications, price badge, and placeholder icon.",
  "frontend/src/components/ServiceCard.tsx": "Reusable card component displaying service information including name, description, and formatted price badge.",
  "frontend/src/components/ServiceRequestForm.tsx": "Controlled form component with validation for submitting service requests, featuring loading states, success alerts, and error handling.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication, handling both authenticated and anonymous actors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching services, products, and service requests from the backend actor, plus a mutation hook for submitting new service requests.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a tech-focused color palette (slate grays, electric green) for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page component featuring a hero section with background image, call-to-action buttons for repair requests and product browsing, and a features grid highlighting service benefits.",
  "frontend/src/pages/ProductsPage.tsx": "Displays a grid of products fetched via useProducts hook, with loading states, error handling, and empty state messaging.",
  "frontend/src/pages/RequestServicePage.tsx": "Service request page with a form for submitting repair requests and informational cards highlighting response time, expert service, and warranty protection.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a grid of available services fetched via useServices hook, with loading states, error handling, and empty state messaging.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (using OKLCH color space), container settings, animations, and plugins for typography and container queries.",
  "project_state.json": "Project state file for a computer repair & sales service application tracking 6 implemented features (service listing, product catalog, request form, tech-focused theme, brand assets, and header name update to 'TestAut') and 1 pending backend data model feature."
}